### CSE - 221710310015 - ETTOM.SRINIJA

### Data Cleaning/Wrangling/Pre-Processing/Scrubbing
    - Import the necessary libraries 
    - Load the data
    - Handling the Missing Values
        - Using Pandas
        - Using Scikit-Learn
    - Encoding the Categorical Variables
        - Using Pandas
        - Using Scikit-Learn
    - Splitting the Dataset into Training set and Test test
    - Feature Scaling
        - Scale
        - MinMaxScaler()
        - StandardScaler()

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as ply
import sklearn

### Importing the data:

In [2]:
data=pd.read_table("http://bit.ly/movieusers")
data

          1|24|M|technician|85711
0              2|53|F|other|94043
1             3|23|M|writer|32067
2         4|24|M|technician|43537
3              5|33|F|other|15213
4          6|42|M|executive|98101
..                            ...
937        939|26|F|student|33319
938  940|32|M|administrator|02215
939        941|20|M|student|97229
940      942|48|F|librarian|78209
941        943|22|M|student|77841

[942 rows x 1 columns]

In [3]:
data=pd.read_table("http://bit.ly/movieusers",sep="|")
data.head(2)
#Separating with | so that the columns get separated.

   1  24  M technician  85711
0  2  53  F      other  94043
1  3  23  M     writer  32067

In [4]:
data=pd.read_table("http://bit.ly/movieusers",sep="|",header=None)
data
#To remove the title of the columns and put it as one of the rows

       0   1  2              3      4
0      1  24  M     technician  85711
1      2  53  F          other  94043
2      3  23  M         writer  32067
3      4  24  M     technician  43537
4      5  33  F          other  15213
..   ...  .. ..            ...    ...
938  939  26  F        student  33319
939  940  32  M  administrator  02215
940  941  20  M        student  97229
941  942  48  F      librarian  78209
942  943  22  M        student  77841

[943 rows x 5 columns]

### Handling Missing Values: (NaN)

In [5]:
df=pd.read_table("https://raw.githubusercontent.com/Mounika-Kajjam/Datasets/master/weather_data.csv",sep=",")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [6]:
df['temperature']

0       32
1   -99999
2       28
3   -99999
4       32
5       31
6       34
Name: temperature, dtype: int64

In [7]:
df['temperature'].value_counts()
#Count of the values

-99999    2
 32       2
 31       1
 28       1
 34       1
Name: temperature, dtype: int64

In [8]:
df.day.dtype
#O->Object dtype

dtype('O')

In [9]:
type(df.day[0])
#String
#But the day columns is date. SO we need to convert into date format

str

In [10]:
df[df.duplicated()]
#Output means no duplicate values

Empty DataFrame
Columns: [day, temperature, windspeed, event]
Index: []

In [11]:
#Checking for specific column
df['temperature'].duplicated()
#True->Duplicate
#False->Not Duplicate
#3,4->-9999,32 are same as row 0,1

0    False
1    False
2    False
3     True
4     True
5    False
6    False
Name: temperature, dtype: bool

In [12]:
#Checking For specific temperature column
df[df['temperature'].duplicated()]

        day  temperature  windspeed event
3  1/4/2017       -99999          7     0
4  1/5/2017           32     -99999  Rain

In [13]:
df[df['event'].duplicated()]

        day  temperature  windspeed  event
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [14]:
df['event'].value_counts()

0        2
Rain     2
Sunny    2
Snow     1
Name: event, dtype: int64

In [27]:
# replacing the -99999 with Nan and replacing 0 to Nan. 
# 0 and missing values ar different, Nan is not a number
new_df=df.replace({"temperature":-99999,"windspeed":-99999,"event": '0'},np.nan)
# passes 2 argumants one is the old and the other is the new
# we have Nan in np.nan
new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0    NaN
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0    NaN

### IMPUTATION: Process of substituting the missing values:

In [28]:
new_df.isnull().sum()

day            0
temperature    2
windspeed      2
event          2
dtype: int64

### fillna():

In [29]:
#fillna() is funtion used to fill missing values
#fillna() works only if df has NaN values
data=new_df.fillna(0)
#Shift+tab 4 times gives tab with documentation for appropriate variables that can be used
data

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          0.0        7.0  Sunny
2  1/3/2017         28.0        0.0   Snow
3  1/4/2017          0.0        7.0      0
4  1/5/2017         32.0        0.0   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0      0

In [31]:
new_df
#Original dataframe

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0    NaN
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0    NaN

### ffill():

In [32]:
#To fill the NaN value with the value from previous row
#ffil->forward fill that takes previous row values
f_data=new_df.fillna(method='ffill')
f_data

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017         32.0        7.0  Sunny
2  1/3/2017         28.0        7.0   Snow
3  1/4/2017         28.0        7.0   Snow
4  1/5/2017         32.0        7.0   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0  Sunny

In [33]:
new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0    NaN
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0    NaN

### bfill():

In [34]:
#bfill->backfill
#Takes the next row values and fills 
b_data =new_df.fillna(method='bfill')
b_data

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017         28.0        7.0  Sunny
2  1/3/2017         28.0        7.0   Snow
3  1/4/2017         32.0        7.0   Rain
4  1/5/2017         32.0        2.0   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0    NaN

### Mean Imputation:
- Filling the missing values with mean of all the remaining values
- Can only be calculated for numerical values obviously

In [35]:
new_df.mean()

temperature    31.4
windspeed       5.4
dtype: float64

In [37]:
#Filling NaN values of temp with mean=31.4
#Filling NaN values of windspeed with mean=5.3
mean_data=new_df.fillna(new_df.mean())
mean_data

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017         31.4        7.0  Sunny
2  1/3/2017         28.0        5.4   Snow
3  1/4/2017         31.4        7.0    NaN
4  1/5/2017         32.0        5.4   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0    NaN

### Median Imputation:
- Fill the missing values with the column median

In [38]:
new_df.median()

temperature    32.0
windspeed       6.0
dtype: float64

In [40]:
median_data=new_df.fillna(new_df.median())
median_data

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017         32.0        7.0  Sunny
2  1/3/2017         28.0        6.0   Snow
3  1/4/2017         32.0        7.0    NaN
4  1/5/2017         32.0        6.0   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0    NaN

### Mode Imputation:
- Can be used for non-numerical values too

In [44]:
new_df.event.mode()

0     Rain
1    Sunny
dtype: object

In [52]:
new_df['event']=new_df['event'].fillna(new_df.event.mode().iloc[0])
new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0   Rain
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0   Rain

### Programming (Problem Solving):
- 12 QUESTION:

### Magic Square:


- Example:
- 19 7  19 93
- 94 18 4  22 
- 5  21 95 17
- 20 92 20 6





- sum of columns is 138
- sum of rows is 138
- sum of both forward and backward diagonal elements sum is 138
- sum of middle square is 138
- sum of all 4 squares sum is 138
- sum of corner elements is 138

In [54]:
import numpy as np
arr1=np.array([[19,7 ,19,93],
               [94,18,4 ,22],
               [5 ,21,95,17],
               [20,92,20,6 ]])

In [59]:
#Sum of middle square is 138
s=0
for i in range(4):
    for j in range(4):
        if i!=0 and i!=3 and j!=0 and j!=3:
            s+=arr1[i,j]
s

138

In [61]:
#Sum of all corner elements is 138
arr1[0,0]+arr1[0,3]+arr1[3,0]+arr1[3,3]

138

In [55]:
#Sum of columns is 138
arr1.sum(axis=1)

array([138, 138, 138, 138])

In [56]:
#sum of rows is 138
arr1.sum(axis=0)

array([138, 138, 138, 138])